export enum Country {
  Ukraine = 'Україна',
  Spain = 'Іспанія',
  Argentina = 'Аргентина',
  Italy = 'Італія',
  Germany = 'Німеччина',
  SouthAfrica = 'Південна Африка',
  Portugal = 'Португалія',
  USA = 'США',
  France = 'Франція',
  Chile = 'Чилі',
}

export enum Type {
  Dry = 'Сухе',
  SemiDry = 'Напівсухе',
  SemiSweet = 'Напівсолодке',
  Sweet = 'Солодке',
}

export enum Color {
  White = 'Біле',
  Red = 'Червоне',
  Rose = 'Рожеве',
}

export enum Strength {
  '15,1%' = '15,1%',
  '15%' = '15%',
  '14%' = '14%',
  '12,9%' = '12,9%',
  '10,5%' = '10,5%',
}

export enum Grape {
  'Каберне Совіньйон' = 'Каберне Совіньйон',
  'Совіньйон Блан' = 'Совіньйон Блан',
  'Айрен' = 'Айрен',
  'Гарнача' = 'Гарнача',
  'Темпранільйо' = 'Темпранільйо',
  'Вердехо' = 'Вердехо',
  'Тінто Фіно' = 'Тінто Фіно',
  'Купаж червоних сортів' = 'Купаж червоних сортів',
  'Купаж білих сортів' = 'Купаж білих сортів',
  'Піно Гріджіо' = 'Піно Гріджіо',
  'Торронтес' = 'Торронтес',
  'Корвіна' = 'Корвіна',
  'Мальбек' = 'Мальбек',
  'Шардоне' = 'Шардоне',
  'Семільйон' = 'Семільйон',
  'Санджовезе' = 'Санджовезе',
  'Сіра' = 'Сіра',
  'Мерло' = 'Мерло',
  'Мускат' = 'Мускат',
  'Рондінелла' = 'Рондінелла',
  'Молінара' = 'Молінара',
  'Гарганега' = 'Гарганега',
  'Гевюрцтрамінер' = 'Гевюрцтрамінер',
  'Трамінер' = 'Трамінер',
  'Рислінг' = 'Рислінг',
  'Дорнфельдер' = 'Дорнфельдер',
  'Шираз' = 'Шираз',
  'Гренаш' = 'Гренаш',
  'Мурведр' = 'Мурведр',
  'Пінотаж' = 'Пінотаж',
  'Сенсо' = 'Сенсо',
  'Шенен Блан' = 'Шенен Блан',
  'Туріга Насіональ' = 'Туріга Насіональ',
  'Туріга Франка' = 'Туріга Франка',
  'Тінта Баррока' = 'Тінта Баррока',
  'Кастелао' = 'Кастелао',
  'Авессу' = 'Авессу',
  'Арінту' = 'Арінту',
  'Лоурейро' = 'Лоурейро',
  'Тражадура' = 'Тражадура',
  'Вьюзінью' = 'Вьюзінью',
  'Гувейо' = 'Гувейо',
  'Кодега' = 'Кодега',
  'Рабігату' = 'Рабігату',
  'Туріга Франсеза' = 'Туріга Франсеза',
  'Тінта Амарела' = 'Тінта Амарела',
  'Сузао' = 'Сузао',
  'Тінта Као' = 'Тінта Као',
  'Тінта Роріц' = 'Тінта Роріц',
  'Тінта Барока' = 'Тінта Барока',
  'Зінфандель' = 'Зінфандель',
  'Пті Вердо' = 'Пті Вердо',
  'Пті Сіра' = 'Пті Сіра',
  'Коломбар' = 'Коломбар',
  'Мускат Оттонель' = 'Мускат Оттонель',
  'Піно Нуар' = 'Піно Нуар',
  'Аліготе' = 'Аліготе',
  'Тельті-Курук' = 'Тельті-Курук',
  'Каберне Фран' = 'Каберне Фран',
  'Карменер' = 'Карменер',
}

export interface Product {
  id: number;
  name: string;
  type: Type;
  color: Color;
  strength: Strength;
  country: Country;
  grape: string;
  price: number;
  description: string;
}

export interface CartProduct extends Product {
  quantity: number;
  cartId: number;
}
